InformationRegisters/ЗадачиГАЗЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиГАЗЗаявки</Name>
			<Comment>Задачи по заявкам ГАЗ: Реестр</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресацияРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Имя интернет-ресурса нашей компании, с которого было получено обращение на автозвонок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Comment>Дата постановки задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура заявки ГАЗ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПерезвона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеПерезвонить</Name>
					<Comment>Напоминание в часах о необходимости перезвона</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокЗакрытия</Name>
					<Comment>Сигнатура звонка закрывшего задачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уточнение</Name>
					<Comment>Причина возврата задачи на повторое исполнение (задача не принята клиентской службой)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗадачиГАЗЗаявки/Ext/ManagerModule.bsl
Функция УстановиЗначениеРеквизитаИЗакройЗадачу(Телефон, ДатаЗакрытия, ИмяРеквизита, ЗначениеРеквизита, ТекущийПользователь="") Экспорт
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = ЛОЖЬ;
	
	Доступно = ТипЗнч(Телефон) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Телефон);
	Доступно = Доступно И ТипЗнч(ДатаЗакрытия)=Тип("Дата");
	Доступно = Доступно И ЗначениеЗаполнено(ДатаЗакрытия);
	Доступно = Доступно И ТипЗнч(ИмяРеквизита)=Тип("Строка");
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	НЗ = РегистрыСведений.ЗадачиГАЗЗаявки.СоздатьМенеджерЗаписи();
	НЗ.Телефон=Телефон;
	НЗ.ДатаЗакрытия=Дата("00010101");
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	ИзмененоЗначениеРеквизита = Ложь;
	НЗ.Телефон = НЗ.Телефон;
	НЗ.ДатаЗакрытия = НЗ.ДатаЗакрытия;
	Для Каждого Рекв Из Метаданные.РегистрыСведений.ЗадачиГАЗЗаявки.Реквизиты Цикл
		НЗ[Рекв.Имя] = НЗ[Рекв.Имя];
		Если Рекв.Имя <> ИмяРеквизита Тогда
			Продолжить
		КонецЕсли;
		Если Не Рекв.Тип.СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда
			Продолжить
		КонецЕсли;
		 НЗ[Рекв.Имя] = ЗначениеРеквизита;
		 ИзмененоЗначениеРеквизита = ИСТИНА;
		 Прервать;
	КонецЦикла;
	
	Если ИзмененоЗначениеРеквизита Тогда
		НЗ.ДатаЗакрытия = ДатаЗакрытия;
		Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
			НЗ.Исполнитель = ТекущийПользователь;
		КонецЕсли;
		Попытка
			НЗ.Записать();
		Исключение
			Данные = "Телефон = "+ Телефон+"; ДатаЗакрытия = "+ДатаЗакрытия+"; ИмяРеквзита = "+ИмяРеквизита+"ЗначениеРеквизита = "+ЗначениеРеквизита;
			Комментарий = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("Ошибка УстановиЗначениеРеквизитаИЗакройЗадачу()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиГАЗЗаявки , Данные, Комментарий);
			Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
		КонецПопытки;	
		Возврат Истина;		
	КонецЕсли;
	
	
КонецФункции

Функция ЗакройЗадачуЗвонкаОткройЗадачуПроверки(Телефон, ДатаЗакрытия, ПричинаРучногоЗакрытия="", СигнатураЗаявкиГАЗ="", Исполнитель = Неопределено, СигнатураЗвонкаЗакрытия = "") Экспорт
	// ДатаЗакрытия  - дата закрытия задачи звонка, она же дата открытия задачи проверки
	// СигнатураЗаявкиГАЗ="" при закрытии при загрузке реестра звонков, и не пустая при ручном закрытии
		
	Результат = Ложь;
	
	НачатьТранзакцию();
	
	//Переменная для сохранения сигнатуры заявки из задачи звонка
	СигнатураЗаявкиВозр = ?(СигнатураЗаявкиГАЗ="", "",СигнатураЗаявкиГАЗ);
	
	Успех = ЗакройЗадачуЗвонка(Телефон, ДатаЗакрытия, ПричинаРучногоЗакрытия, Исполнитель, СигнатураЗаявкиВозр,, СигнатураЗвонкаЗакрытия);	
	Доступно = Истина;
	Доступно = Успех = Ложь;
	Доступно = Доступно И ТранзакцияАктивна();
	Если Успех = Ложь Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
		
	Успех = СоздайЗадачуПроверки(Телефон, ДатаЗакрытия,	СигнатураЗаявкиВозр);
	Доступно = Истина;
	Доступно = Успех = Ложь;
	Доступно = Доступно И ТранзакцияАктивна();
	Если Успех = Ложь Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Результат = Истина;
	Возврат Результат;
КонецФункции

Функция ЗакройЗадачуЗвонка(Телефон, ДатаЗакрытия, ПричинаРучногоЗакрытия = "", Исполнитель = Неопределено, СигнатураВозр = "", Комментарий = "", СигнатураЗвонкаЗакрытия = "") Экспорт
	// СигнатураВозр - возвращаемое значение сигнатуры заявки ГАЗ, если закрыли задачу звонка
	
	Результат = Ложь;
	
	Доступно = Истина;
	Доступно = Доступно	И ТипЗнч(Телефон) 		= Тип("Строка");
	Доступно = Доступно И ТипЗнч(ДатаЗакрытия) 	= Тип("Дата");
	Доступно = Доступно И ЗначениеЗаполнено(Телефон);
	Доступно = Доступно И ЗначениеЗаполнено(ДатаЗакрытия);
	
	
	Данные = "Телефон="+Телефон+"; ДатаЗакрытия="+ДатаЗакрытия+ "; Исполнитель="+Исполнитель;
	Если Не Доступно Тогда
		ЗаписьЖурналаРегистрации("Ошибка закрытия задачи: ошибка аргументов", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиИнтернетЗаявки, Данные, "Ошибка типа или заполнения аргументов");
		Возврат Результат;
	КонецЕсли;
		
	НЗ = РегистрыСведений.ЗадачиГАЗЗаявки.СоздатьМенеджерЗаписи();
	НЗ.Телефон = Телефон;
	НЗ.ДатаЗакрытия = '00010101000000';
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат Результат
	КонецЕсли;
	
	//Закрыть только задачу звонка
	//----------------------------
	Если НЗ.АдресацияРоль <> Справочники.Роли.ОператорКонтактЦентра Тогда
		Возврат Результат
	КонецЕсли;
		
	НЗ.ДатаЗакрытия = ДатаЗакрытия;
	
	Если ЗначениеЗаполнено(ПричинаРучногоЗакрытия) Тогда
		НЗ.ПричинаЗакрытия = ПричинаРучногоЗакрытия;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		НЗ.Исполнитель 	= Исполнитель;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Комментарий) Тогда
		НЗ.Комментарий = Комментарий;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СигнатураЗвонкаЗакрытия) Тогда
		НЗ.ЗвонокЗакрытия = СигнатураЗвонкаЗакрытия;
	КонецЕсли;
	
	//Верни значение сигнатуры ГАЗ-Заявки
	//-----------------------------------
	СигнатураВозр = НЗ.Сигнатура;
	
	Попытка
		НЗ.Записать();
		Результат = Истина;
	Исключение
		Комментарий  = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Ошибка закрытия задачи", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиГАЗЗаявки, Данные, Комментарий);
		Возврат Результат;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ЗакройЗадачуПроверкиОткройЗадачуЗвонка(Телефон, ДатаЗакрытия, Исполнитель, СигнатураЗаявки, Комментарий = "") Экспорт
	// ДатаЗакрытия - дата закрытия задачи проверки, дата открытия задачи звонка
	
	Результат = Ложь;
	
	НачатьТранзакцию();
	
	Успех = ЗакройЗадачу(Телефон, ДатаЗакрытия, "", Исполнитель, ,Комментарий);	
	Доступно = Истина;
	Доступно = Успех = Ложь;
	Доступно = Доступно И ТранзакцияАктивна();
	Если Успех = Ложь Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
		
	Успех = СоздайЗадачуЗвонка(Телефон, ДатаЗакрытия, СигнатураЗаявки, Комментарий);
	Доступно = Истина;
	Доступно = Успех = Ложь;
	Доступно = Доступно И ТранзакцияАктивна();
	Если Успех = Ложь Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Результат = Истина;
	Возврат Результат;
		
КонецФункции

Функция СоздайЗадачуПроверки(Телефон, ДатаПостановки, СигнатураЗаявки = "")
	// У задачи проверки дата постановки равна дате закрытия задачи звонка
	
	Результат = Ложь;
	
	Доступно = Истина;
	Доступно = Доступно И ТипЗнч(Телефон)					= Тип("Строка");
	Доступно = Доступно И ТипЗнч(ДатаПостановки) 			= Тип("Дата");
	Доступно = Доступно	И ТипЗнч(СигнатураЗаявки)			= Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Телефон);
	Доступно = Доступно и ЗначениеЗаполнено(ДатаПостановки);
	
	Если Не Доступно Тогда
		Возврат Результат;
	КонецЕсли;
	
	Зап = РегистрыСведений.ЗадачиГАЗЗаявки.СоздатьМенеджерЗаписи();
	Зап.Телефон			= Телефон;
	Зап.ДатаЗакрытия 	= '00010101';
	Зап.ДатаПостановки	= ДатаПостановки;
	Зап.АдресацияРоль	= Справочники.Роли.КлиентскаяСлужбаЦентр_Администратор;
	
	Доступно = Истина;
	Доступно = Доступно И Не ЗначениеЗаполнено(Зап.Сигнатура);
	Доступно = Доступно И ЗначениеЗаполнено(СигнатураЗаявки);
	Зап.Сигнатура  =  СигнатураЗаявки;
	
	Попытка
		Зап.Записать();
		Результат = Истина;
	Исключение
		Данные = "Телефон = "+Телефон+"; ДатаПостановки = "+ДатаПостановки+"; СигнатураЗаявки = "+СигнатураЗаявки;
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Ошибка создания задачи проверки", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиГАЗЗаявки, Данные, Комментарий);
		Результат = Ложь;
	КонецПопытки;
	Возврат Результат;
КонецФункции

Функция СоздайЗадачуЗвонка(Телефон, ДатаПостановки, СигнатураЗаявки, Комментарий = "") Экспорт
	// У задачи проверки дата постановки равна дате закрытия задачи звонка
	
	Результат = Ложь;
	
	Доступно = Истина;
	Доступно = Доступно И ТипЗнч(Телефон)					= Тип("Строка");
	Доступно = Доступно И ТипЗнч(ДатаПостановки) 			= Тип("Дата");
	Доступно = Доступно	И ТипЗнч(СигнатураЗаявки)			= Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Телефон);
	Доступно = Доступно и ЗначениеЗаполнено(ДатаПостановки);
	Доступно = Доступно И ЗначениеЗаполнено(СигнатураЗаявки);
	
	Если Не Доступно Тогда
		Возврат Результат;
	КонецЕсли;
	
	Зап = РегистрыСведений.ЗадачиГАЗЗаявки.СоздатьМенеджерЗаписи();
	Зап.Телефон			= Телефон;
	Зап.ДатаЗакрытия 	= '00010101';
	Зап.Сигнатура		= СигнатураЗаявки;
	Зап.ДатаПостановки	= ДатаПостановки;
	Зап.АдресацияРоль	= Справочники.Роли.ОператорКонтактЦентра;
	Зап.Комментарий		= Комментарий;
	
	Попытка
		Зап.Записать();
		Результат = Истина;
	Исключение
		Данные = "Телефон = "+Телефон+"; ДатаПостановки = "+ДатаПостановки+"; СигнатураЗаявки = "+СигнатураЗаявки;
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Ошибка создания задачи звонка", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиГАЗЗаявки, Данные, Комментарий);
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

Функция ЗакройЗадачу(Телефон, ДатаЗакрытия, ПричинаРучногоЗакрытия = "", Исполнитель = Неопределено, СигнатураВозр = "", Комментарий = "", СигнатураЗвонкаЗакрытия = "") Экспорт
	// СигнатураВозр - возвращаемое значение сигнатуры заявки ГАЗ, если закрыли задачу звонка
	
	Результат = Ложь;
	
	Доступно = Истина;
	Доступно = Доступно	И ТипЗнч(Телефон) 		= Тип("Строка");
	Доступно = Доступно И ТипЗнч(ДатаЗакрытия) 	= Тип("Дата");
	Доступно = Доступно И ЗначениеЗаполнено(Телефон);
	Доступно = Доступно И ЗначениеЗаполнено(ДатаЗакрытия);
	
	
	Данные = "Телефон="+Телефон+"; ДатаЗакрытия="+ДатаЗакрытия+ "; Исполнитель="+Исполнитель;
	Если Не Доступно Тогда
		ЗаписьЖурналаРегистрации("Ошибка закрытия задачи: ошибка аргументов", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиИнтернетЗаявки, Данные, "Ошибка типа или заполнения аргументов");
		Возврат Результат;
	КонецЕсли;
		
	НЗ = РегистрыСведений.ЗадачиГАЗЗаявки.СоздатьМенеджерЗаписи();
	НЗ.Телефон = Телефон;
	НЗ.ДатаЗакрытия = '00010101000000';
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат Результат
	КонецЕсли;
		
	НЗ.ДатаЗакрытия = ДатаЗакрытия;
	
	Если ЗначениеЗаполнено(ПричинаРучногоЗакрытия) Тогда
		НЗ.ПричинаЗакрытия = ПричинаРучногоЗакрытия;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		НЗ.Исполнитель 	= Исполнитель;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Комментарий) Тогда
		НЗ.Комментарий = Комментарий;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СигнатураЗвонкаЗакрытия) Тогда
		НЗ.ЗвонокЗакрытия = СигнатураЗвонкаЗакрытия;
	КонецЕсли;
	
	//Верни значение сигнатуры ГАЗ-Заявки
	//-----------------------------------
	СигнатураВозр = НЗ.Сигнатура;
	
	Попытка
		НЗ.Записать();
		Результат = Истина;
	Исключение
		Комментарий  = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Ошибка закрытия задачи", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиГАЗЗаявки, Данные, Комментарий);
		Возврат Результат;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции
	
Функция УстановиЗначениеРеквизита(Телефон, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = Ложь;
	
	
	Доступно = ТипЗнч(Телефон) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Телефон);
	Доступно = Доступно И ТипЗнч(ИмяРеквизита)=Тип("Строка");
	Доступно = Доступно И ТипЗнч(ЗначениеРеквизита)<> Тип("Неопределено");
	Доступно = Доступно И ЗначениеЗаполнено(ЗначениеРеквизита);
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	НЗ 				= 	РегистрыСведений.ЗадачиГАЗЗаявки.СоздатьМенеджерЗаписи();
	НЗ.Телефон		=	Телефон;
	НЗ.ДатаЗакрытия	=	'00010101';
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	ИзмененоЗначениеРеквизита = Ложь;
	НЗ.Телефон 		=	Телефон;
	НЗ.ДатаЗакрытия =	'00010101';
	Для Каждого Рекв Из Метаданные.РегистрыСведений.ЗадачиГАЗЗаявки.Реквизиты Цикл
		НЗ[Рекв.Имя] = НЗ[Рекв.Имя];
		Если Рекв.Имя <> ИмяРеквизита Тогда
			Продолжить
		КонецЕсли;
		Если Не Рекв.Тип.СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда
			Продолжить
		КонецЕсли;
		
		НЗ.Комментарий = НЗ.Комментарий + Символы.ПС+" "+ТекущаяДата()+" изменен "  +ИмяРеквизита+ " с """+НЗ[Рекв.Имя]+""" на """+ЗначениеРеквизита+""" пользователем "+ПараметрыСеанса.ТекущийПользователь;
		НЗ[Рекв.Имя] = ЗначениеРеквизита;
		ИзмененоЗначениеРеквизита = Истина;
		Прервать;
	КонецЦикла;
	
	Если Не ИзмененоЗначениеРеквизита Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецЕсли;
	
	Попытка
		НЗ.Записать();
		Возврат Истина;
	Исключение
		ЗаписьЖурналаРегистрации("УстановиЗначениеРеквизита()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиГАЗЗаявки, , ОписаниеОшибки());
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецПопытки;
	
КонецФункции
